<<<<<<< HEAD
﻿// Создание кода T4 для модели "C:\Users\Danil\Desktop\HelpDesk-master\HelpDesk\Model1.edmx" включено. 
=======
﻿// Создание кода T4 для модели "C:\Users\Danil\Desktop\HelpDesk\HelpDesk\Model1.edmx" включено. 
>>>>>>> 29a32eda876879c287a4a4cc66c7db697a210e58
// Чтобы включить формирование кода прежних версий, измените значение свойства "Стратегия создания кода" конструктора
// на "Legacy ObjectContext". Это свойство доступно в окне "Свойства", если модель
// открыта в конструкторе.

// Если не сформированы контекст и классы сущности, возможная причина в том, что вы создали пустую модель, но
// еще не выбрали версию Entity Framework для использования. Чтобы сформировать класс контекста и классы сущностей
// для своей модели, откройте модель в конструкторе, щелкните правой кнопкой область конструктора и
// выберите "Обновить модель из базы данных", "Сформировать базу данных из модели" или "Добавить элемент формирования
// кода...".